app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index
    if params[:artist_id]
      if artist = Artist.find_by(id: params[:artist_id])
        @songs = artist.songs
      else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 12345]]
---
  def show
    # @song = Song.find_by(id: params[:id])
    # if !@song
    #   @artist = Artist.find_by_id(params[:artist_id])
    #   flash[:alert] = "Song not found."
    #   redirect_to artist_songs_path(@artist)
    # end

    if params[:artist_id]
      if @artist = Artist.find_by(id: params[:artist_id])
        @song = @artist.song.find_by(id: params[:id])